#+TITLE: LaTeX Snippets

#+BEGIN_SRC emacs-lisp :exports results
(aas--format-doc-to-org 'laas-basic-snippets)
#+END_SRC

#+RESULTS:
: Basic snippets. Expand only inside maths.

#+BEGIN_SRC emacs-lisp :exports results
(aas--format-snippet-array laas-basic-snippets)
#+END_SRC

#+RESULTS:
| ~!=~     | \neq                |
| ~!>~     | \mapsto             |
| ~**~     | \cdot               |
| ~+-~     | \pm                 |
| ~-+~     | \mp                 |
| ~->~     | \to                 |
| ~...~    | \dots               |
| ~<<~     | \ll                 |
| ~<=~     | \leq                |
| ~<>~     | \diamond            |
| ~=<~     | \impliedby          |
| ~==~     | &=                  |
| ~=>~     | \implies            |
| ~>=~     | \geq                |
| ~>>~     | \gg                 |
| ~AA~     | \forall             |
| ~EE~     | \exists             |
| ~cb~     | ^3                  |
| ~iff~    | \iff                |
| ~inn~    | \in                 |
| ~notin~  | \not\in             |
| ~sr~     | ^2                  |
| ~xx~     | \times              |
| ~❘->~    | \mapsto             |
| ~❘❘~     | \mid                |
| ~∽=~     | \approx             |
| ~∽∽~     | \sim                |
| ~arccos~ | \arccos             |
| ~arccot~ | \arccot             |
| ~arccot~ | \arccot             |
| ~arccsc~ | \arccsc             |
| ~arcsec~ | \arcsec             |
| ~arcsin~ | \arcsin             |
| ~arctan~ | \arctan             |
| ~cos~    | \cos                |
| ~cot~    | \cot                |
| ~csc~    | \csc                |
| ~exp~    | \exp                |
| ~ln~     | \ln                 |
| ~log~    | \log                |
| ~perp~   | \perp               |
| ~sin~    | \sin                |
| ~star~   | \star               |
| ~gcd~    | \gcd                |
| ~CC~     | \CC                 |
| ~FF~     | \FF                 |
| ~HH~     | \HH                 |
| ~NN~     | \NN                 |
| ~PP~     | \PP                 |
| ~QQ~     | \QQ                 |
| ~RR~     | \RR                 |
| ~ZZ~     | \ZZ                 |
| ~;a~     | \alpha              |
| ~;A~     | \forall             |
| ~;;A~    | \aleph              |
| ~;b~     | \beta               |
| ~;;;c~   | \cos                |
| ~;;;C~   | \arccos             |
| ~;d~     | \delta              |
| ~;;d~    | \partial            |
| ~;D~     | \Delta              |
| ~;;D~    | \nabla              |
| ~;e~     | \epsilon            |
| ~;;e~    | \varepsilon         |
| ~;;;e~   | \exp                |
| ~;E~     | \exists             |
| ~;;;E~   | \ln                 |
| ~;f~     | \phi                |
| ~;;f~    | \varphi             |
| ~;F~     | \Phi                |
| ~;g~     | \gamma              |
| ~;;;g~   | \lg                 |
| ~;G~     | \Gamma              |
| ~;;;G~   | 10^{?}              |
| ~;h~     | \eta                |
| ~;;h~    | \hbar               |
| ~;i~     | \in                 |
| ~;;i~    | \imath              |
| ~;I~     | \iota               |
| ~;;I~    | \Im                 |
| ~;;j~    | \jmath              |
| ~;k~     | \kappa              |
| ~;l~     | \lambda             |
| ~;;l~    | \ell                |
| ~;;;l~   | \log                |
| ~;L~     | \Lambda             |
| ~;m~     | \mu                 |
| ~;n~     | \nu                 |
| ~;;;n~   | \ln                 |
| ~;N~     | \nabla              |
| ~;;;N~   | \exp                |
| ~;o~     | \omega              |
| ~;O~     | \Omega              |
| ~;;O~    | \mho                |
| ~;p~     | \pi                 |
| ~;;p~    | \varpi              |
| ~;P~     | \Pi                 |
| ~;q~     | \theta              |
| ~;;q~    | \vartheta           |
| ~;Q~     | \Theta              |
| ~;r~     | \rho                |
| ~;;r~    | \varrho             |
| ~;;R~    | \Re                 |
| ~;s~     | \sigma              |
| ~;;s~    | \varsigma           |
| ~;;;s~   | \sin                |
| ~;S~     | \Sigma              |
| ~;;;S~   | \arcsin             |
| ~;t~     | \tau                |
| ~;;;t~   | \tan                |
| ~;;;T~   | \arctan             |
| ~;u~     | \upsilon            |
| ~;U~     | \Upsilon            |
| ~;v~     | \vee                |
| ~;V~     | \Phi                |
| ~;w~     | \xi                 |
| ~;W~     | \Xi                 |
| ~;x~     | \chi                |
| ~;y~     | \psi                |
| ~;Y~     | \Psi                |
| ~;z~     | \zeta               |
| ~;0~     | \emptyset           |
| ~;8~     | \infty              |
| ~;!~     | \neg                |
| ~;^~     | \uparrow            |
| ~;&~     | \wedge              |
| ~;∽~     | \approx             |
| ~;;∽~    | \simeq              |
| ~;_~     | \downarrow          |
| ~;+~     | \cup                |
| ~;-~     | \leftrightarrow     |
| ~;;-~    | \longleftrightarrow |
| ~;*~     | \times              |
| ~;/~     | \not                |
| ~;❘~     | \mapsto             |
| ~;;❘~    | \longmapsto         |
| ~;\~     | \setminus           |
| ~;=~     | \Leftrightarrow     |
| ~;;=~    | \Longleftrightarrow |
| ~;(~     | \langle             |
| ~;)~     | \rangle             |
| ~;[~     | \Leftarrow          |
| ~;;[~    | \Longleftarrow      |
| ~;]~     | \Rightarrow         |
| ~;;]~    | \Longrightarrow     |
| ~;{~     | \subset             |
| ~;}~     | \supset             |
| ~;<~     | \leftarrow          |
| ~;;<~    | \longleftarrow      |
| ~;;;<~   | \min                |
| ~;>~     | \rightarrow         |
| ~;;>~    | \longrightarrow     |
| ~;;;>~   | \max                |
| ~;'~     | \prime              |
| ~;.~     | \cdot               |


#+BEGIN_SRC emacs-lisp :exports results
(aas--format-doc-to-org 'laas-subscript-snippets)
#+END_SRC

#+RESULTS:
: Automatic subscripts! Expand In math and after a single letter.

#+BEGIN_SRC emacs-lisp :exports results
(aas--format-snippet-array laas-subscript-snippets)
#+END_SRC

#+RESULTS:
| ~ii~  | X_i, or X_{Yi} if a subscript was typed already |
| ~ip1~ | _{i+1}                                          |
| ~jj~  | X_j, or X_{Yj} if a subscript was typed already |
| ~jp1~ | _{j+1}                                          |
| ~nn~  | X_n, or X_{Yn} if a subscript was typed already |
| ~np1~ | _{n+1}                                          |
| ~kk~  | X_k, or X_{Yk} if a subscript was typed already |
| ~kp1~ | _{k+1}                                          |
| ~0~   | X_0, or X_{Y0} if a subscript was typed already |
| ~1~   | X_1, or X_{Y1} if a subscript was typed already |
| ~2~   | X_2, or X_{Y2} if a subscript was typed already |
| ~3~   | X_3, or X_{Y3} if a subscript was typed already |
| ~4~   | X_4, or X_{Y4} if a subscript was typed already |
| ~5~   | X_5, or X_{Y5} if a subscript was typed already |
| ~6~   | X_6, or X_{Y6} if a subscript was typed already |
| ~7~   | X_7, or X_{Y7} if a subscript was typed already |
| ~8~   | X_8, or X_{Y8} if a subscript was typed already |
| ~9~   | X_9, or X_{Y9} if a subscript was typed already |


#+BEGIN_SRC emacs-lisp :exports results
(aas--format-doc-to-org 'laas-frac-snippet)
#+END_SRC

#+RESULTS:
: Frac snippet. Expand in maths when there~s something to frac on on the left.

#+BEGIN_SRC emacs-lisp :exports results
(aas--format-snippet-array laas-frac-snippet)
#+END_SRC

#+RESULTS:
| ~/~ | Wrap object on the left with \frac{}{}, leave `point' in the denuminator. |


#+BEGIN_SRC emacs-lisp :exports results
(aas--format-doc-to-org 'laas-accent-snippets)
#+END_SRC

#+RESULTS:
: A simpler way to apply accents. Expand If LaTeX symbol immidiately before point.

#+BEGIN_SRC emacs-lisp :exports results
(aas--format-snippet-array laas-accent-snippets)
#+END_SRC

#+RESULTS:
| ~.␣~  | Wrap in \dot{}      |
| ~..␣~ | Wrap in \dot{}      |
| ~,.~  | Wrap in \vec{}      |
| ~.,~  | Wrap in \vec{}      |
| ~∽␣~  | Wrap in \tilde{}    |
| ~hat~ | Wrap in \hat{}      |
| ~bar~ | Wrap in \overline{} |
